Graph:
Choose Vertices:
Number of Vertices: 43
30 63 17 69 72 37 74 62 45 75 25 83 1 47 60 67 14 32 12 3 80 27 66 51 39 81 44 13 79 29 19 77 57 71 73 86 53 18 7 76 65 4 52
Probability Vertices:
Number of Vertices: 44
50 16 26 34 85 55 78 49 2 21 35 15 6 68 87 23 24 82 64 20 36 38 22 46 70 28 9 41 59 54 58 11 40 42 56 10 84 8 43 61 31 5 48 33
Choose Edges:
Number of Edges: 45
30 31
63 64
69 70
72 73
37 38
74 75
62 63
45 46
75 76
25 26
25 28
83 84
1 2
47 48
60 61
67 68
14 15
14 9
32 37
12 13
3 4
80 81
27 40
66 67
51 63
39 40
81 82
44 45
13 14
79 80
79 86
29 30
19 20
19 21
77 78
57 58
71 72
73 74
86 87
53 54
18 19
7 8
65 66
4 5
52 53
Probability Edges:
Number of Edges: 45
50 51 1.0
16 17 0.701970275995
16 18 0.298029724005
26 27 1.0
34 35 1.0
55 56 1.0
78 79 1.0
49 50 1.0
2 3 1.0
21 22 1.0
35 36 1.0
15 16 1.0
6 7 1.0
68 69 1.0
23 24 1.0
24 25 1.0
82 83 1.0
64 65 0.542953452918
64 52 0.457046547082
36 37 1.0
38 39 0.506239810474
38 33 0.493760189526
22 23 1.0
46 47 1.0
70 71 0.376941521571
70 77 0.623058478429
28 29 1.0
9 10 1.0
41 42 1.0
59 60 1.0
54 55 1.0
58 59 1.0
11 12 1.0
40 41 1.0
42 43 1.0
56 57 1.0
10 11 1.0
84 85 1.0
8 13 1.0
43 44 1.0
61 62 1.0
31 32 1.0
5 6 1.0
48 49 1.0
33 34 1.0

Tree:
Vertices:
Number of Vertices: 87
87
86 87
86 79
85 79
84 85 79
83 84 79
82 83 79
81 82 79
80 81 79
78 79
77 78
70 77
70 76
70 75 76
70 74 75
70 73 74
70 72 73
70 71 72
69 70
68 69
67 68
66 67
65 66
64 65
64 51
64 51 63
64 62 63
64 61 62
64 60 61
64 59 60
64 58 59
64 57 58
64 56 57
64 55 56
64 54 55
64 53 54
64 52 53
50 51
49 50
48 49
48 47
46 47
45 46
44 45
43 44
42 43
41 42
40 41
40 25
39 40 25
38 39 25
32 38 25
32 37 38
36 37 38
35 36 38
34 35 38
33 34 38
32 25 31
25 30 31
25 29 30
25 28 29
40 25 27
25 26 27
24 25
23 24
22 23
21 22
19 21
19 20
18 19
16 18
16 17
16 15
14 15
8 14
8 13 14
12 13 14
11 12 14
10 11 14
9 10 14
7 8
6 7
5 6
4 5
3 4
2 3
1 2
Edges:
2 1
3 2
4 3
5 4
6 5
7 6
8 7
9 8
10 3
11 10
12 11
13 12
14 13
15 14
16 15
17 16
18 17
19 12
20 19
21 20
22 21
23 22
24 23
25 24
26 25
27 26
28 27
29 28
30 29
31 30
32 31
33 32
34 33
35 34
36 35
37 36
38 25
39 38
40 39
41 40
42 41
43 42
44 43
45 44
46 45
47 46
48 47
49 48
50 49
51 50
52 51
53 52
54 53
55 54
56 55
57 56
58 52
59 58
60 59
61 60
62 49
63 62
64 49
65 64
66 65
67 66
68 67
69 68
70 68
71 70
72 71
73 71
74 73
75 74
76 75
77 76
78 77
79 78
80 79
81 75
82 81
83 82
84 83
85 84
86 85
87 86
